bench-results/2016042502/02-etcdv3-nocompression-result.log
nohup: ignoring input

2016/04/25 12:34:59 Step 1: starting databases...
2016/04/25 12:34:59 [0] Start etcdv3 at 10.240.0.21:3500
2016/04/25 12:34:59 [0] Response from 10.240.0.21:3500 (success:true )
2016/04/25 12:35:00 [1] Start etcdv3 at 10.240.0.22:3500
2016/04/25 12:35:00 [1] Response from 10.240.0.22:3500 (success:true )
2016/04/25 12:35:01 [2] Start etcdv3 at 10.240.0.23:3500
2016/04/25 12:35:01 [2] Response from 10.240.0.23:3500 (success:true )

2016/04/25 12:35:07 Step 2: starting tests...
 0 / 1000000 B                                                                                            !   0.00%2016/04/25 12:35:07 finalize has started
 1000000 / 1000000 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 36s

Summary:
  Total:	36.5704 secs.
  Slowest:	0.2053 secs.
  Fastest:	0.0067 secs.
  Average:	0.0364 secs.
  Stddev:	0.0238 secs.
  Requests/sec:	27344.5518

Response time histogram:
  0.007 [1]	|
  0.027 [467197]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.046 [321353]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.066 [97605]	|∎∎∎∎∎∎∎∎
  0.086 [51886]	|∎∎∎∎
  0.106 [40253]	|∎∎∎
  0.126 [15855]	|∎
  0.146 [3721]	|
  0.166 [1108]	|
  0.185 [520]	|
  0.205 [501]	|

Latency distribution:
  10% in 0.0173 secs.
  25% in 0.0210 secs.
  50% in 0.0276 secs.
  75% in 0.0414 secs.
  90% in 0.0700 secs.
  95% in 0.0912 secs.
  99% in 0.1178 secs.
unix_ts,avg_latency_ms,throughput
1461587707,29.995083,19861
1461587708,30.461709,32502
1461587709,33.619075,29633
1461587710,34.357141,28943
1461587711,35.162439,28470
1461587712,33.995673,29055
1461587713,35.383990,28219
1461587714,35.451962,28173
1461587715,39.092018,25520
1461587716,35.613843,27434
1461587717,38.387757,26417
1461587718,37.984474,26101
1461587719,35.715894,27258
1461587720,37.260513,27151
1461587721,35.346607,27926
1461587722,36.306291,27350
1461587723,36.141478,27895
1461587724,37.116024,26687
1461587725,35.427511,28206
1461587726,36.792569,26249
1461587727,37.153566,26933
1461587728,36.169159,28088
1461587729,37.969190,26435
1461587730,37.009277,26692
1461587731,36.426527,27104
1461587732,37.311130,26291
1461587733,38.712166,26606
1461587734,36.251894,27090
1461587735,38.384177,26450
1461587736,36.877549,26363
1461587737,36.870413,26537
1461587738,38.254524,26645
1461587739,37.240872,26507
1461587740,37.441832,27269
1461587741,35.833803,26785
1461587742,38.562000,26470
1461587743,40.624454,22685

2016/04/25 12:35:44 time series saved... Uploading to Google cloud storage...
2016/04/25 12:35:44 Uploading timeseries.csv to 2016042502/02-etcdv3-nocompression-timeseries.csv
UploadFile:

timeseries.csv
--->
2016042502/02-etcdv3-nocompression-timeseries.csv


UploadFile Done!

2016/04/25 12:35:45 Uploading result.log to 2016042502/02-etcdv3-nocompression-result.log
UploadFile:

result.log
--->
2016042502/02-etcdv3-nocompression-result.log