bench-results/2016042502/02-etcdv3-snappy-result.log
nohup: ignoring input

2016/04/25 12:34:57 Step 1: starting databases...
2016/04/25 12:34:57 [0] Start etcdv3 at 10.240.0.25:3500
2016/04/25 12:34:57 [0] Response from 10.240.0.25:3500 (success:true )
2016/04/25 12:34:58 [1] Start etcdv3 at 10.240.0.26:3500
2016/04/25 12:34:58 [1] Response from 10.240.0.26:3500 (success:true )
2016/04/25 12:34:59 [2] Start etcdv3 at 10.240.0.27:3500
2016/04/25 12:34:59 [2] Response from 10.240.0.27:3500 (success:true )

2016/04/25 12:35:05 Step 2: starting tests...
 0 / 1000000 B                                                                                            !   0.00%2016/04/25 12:35:06 finalize has started
 1000000 / 1000000 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 39s

Summary:
  Total:	39.7178 secs.
  Slowest:	0.1822 secs.
  Fastest:	0.0056 secs.
  Average:	0.0391 secs.
  Stddev:	0.0241 secs.
  Requests/sec:	25177.6543

Response time histogram:
  0.006 [1]	|
  0.023 [260884]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.041 [442293]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.059 [131295]	|∎∎∎∎∎∎∎∎∎∎∎
  0.076 [67164]	|∎∎∎∎∎∎
  0.094 [46182]	|∎∎∎∎
  0.112 [35388]	|∎∎∎
  0.129 [12831]	|∎
  0.147 [2405]	|
  0.165 [816]	|
  0.182 [741]	|

Latency distribution:
  10% in 0.0187 secs.
  25% in 0.0229 secs.
  50% in 0.0308 secs.
  75% in 0.0450 secs.
  90% in 0.0757 secs.
  95% in 0.0948 secs.
  99% in 0.1180 secs.
unix_ts,avg_latency_ms,throughput
1461587706,29.953455,29592
1461587707,32.617533,29309
1461587708,35.683975,27598
1461587709,36.269241,26810
1461587710,36.276258,27444
1461587711,36.974012,26522
1461587712,38.332450,25812
1461587713,37.905881,25517
1461587714,39.480126,25224
1461587715,38.112233,25952
1461587716,37.763392,25440
1461587717,36.980197,26823
1461587718,38.501789,25628
1461587719,37.984685,25293
1461587720,37.689367,26402
1461587721,38.675315,25046
1461587722,39.635671,25603
1461587723,40.253115,24567
1461587724,39.349865,24910
1461587725,39.053380,25304
1461587726,38.693376,25443
1461587727,40.746275,24298
1461587728,37.781755,25235
1461587729,39.412643,25674
1461587730,41.832392,22728
1461587731,41.386648,24807
1461587732,38.153036,25847
1461587733,41.781049,23515
1461587734,42.546270,22548
1461587735,43.194549,23685
1461587736,40.549853,24282
1461587737,40.775059,24088
1461587738,43.289874,23066
1461587739,36.914541,25450
1461587740,41.910771,24564
1461587741,41.311872,22681
1461587742,43.125193,24057
1461587743,42.658105,21831
1461587744,44.602167,22025
1461587745,42.092999,19380

2016/04/25 12:35:46 time series saved... Uploading to Google cloud storage...
2016/04/25 12:35:46 Uploading timeseries.csv to 2016042502/02-etcdv3-snappy-timeseries.csv
UploadFile:

timeseries.csv
--->
2016042502/02-etcdv3-snappy-timeseries.csv


UploadFile Done!

2016/04/25 12:35:46 Uploading result.log to 2016042502/02-etcdv3-snappy-result.log
UploadFile:

result.log
--->
2016042502/02-etcdv3-snappy-result.log